Тестовая_база_ERP_14/src/Catalogs/ВидыИспользованияРабочегоВремени/ВидыИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыИспользованияРабочегоВремени</name>
  <predefined>
    <items>
      <name>Болезнь</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>БолезньБезОплаты</name>
      <description>Болезнь без оплаты</description>
    </items>
    <items>
      <name>Вахта</name>
      <description>Вахта</description>
    </items>
    <items>
      <name>ВынужденныйПрогул</name>
      <description>Вынужденный прогул</description>
    </items>
    <items>
      <name>ВыходныеДни</name>
      <description>Выходные дни</description>
    </items>
    <items>
      <name>ГосударственныеОбязанности</name>
      <description>Государственные обязанности</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
      <description>Дополнительные выходные дни не оплачиваемые</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниОплачиваемые</name>
      <description>Дополнительные выходные дни оплачиваемые</description>
    </items>
    <items>
      <name>ДополнительныйОтпуск</name>
      <description>Дополнительный отпуск</description>
    </items>
    <items>
      <name>Забастовка</name>
      <description>Забастовка</description>
    </items>
    <items>
      <name>ЗадержкаВыплатыЗаработнойПлаты</name>
      <description>Задержка выплаты заработной платы</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Командировка</description>
    </items>
    <items>
      <name>КормлениеРебенка</name>
      <description>Кормление ребенка</description>
    </items>
    <items>
      <name>НеоплачиваемыйДополнительныйОтпуск</name>
      <description>Неоплачиваемый дополнительный отпуск</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоЗаконодательству</name>
      <description>Неоплачиваемый отпуск по законодательству</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоРазрешениюРаботодателя</name>
      <description>Неоплачиваемый отпуск по разрешению работодателя</description>
    </items>
    <items>
      <name>НеявкиПоНевыясненнымПричинам</name>
      <description>Неявки по невыясненным причинам</description>
    </items>
    <items>
      <name>ОсновнойОтпуск</name>
      <description>Основной отпуск</description>
    </items>
    <items>
      <name>ОтпускНаОбучение</name>
      <description>Отпуск на обучение</description>
    </items>
    <items>
      <name>ОтпускНаОбучениеНеоплачиваемый</name>
      <description>Отпуск на обучение неоплачиваемый</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Отпуск по беременности и родам</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>Отпуск по уходу за ребенком</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыБезОплаты</name>
      <description>Отстранение от работы без оплаты</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыСОплатой</name>
      <description>Отстранение от работы с оплатой</description>
    </items>
    <items>
      <name>ПовышениеКвалификации</name>
      <description>Повышение квалификации</description>
    </items>
    <items>
      <name>ПовышениеКвалификацииВДругойМестности</name>
      <description>Повышение квалификации в другой местности</description>
    </items>
    <items>
      <name>Праздники</name>
      <description>Праздники</description>
    </items>
    <items>
      <name>ПраздникиБезПовышеннойОплаты</name>
      <description>Праздники без повышенной оплаты</description>
    </items>
    <items>
      <name>Прогулы</name>
      <description>Прогулы</description>
    </items>
    <items>
      <name>Простой</name>
      <description>Простой</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботника</name>
      <description>Простой по вине работника</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателя</name>
      <description>Простой по вине работодателя</description>
    </items>
    <items>
      <name>РаботаВРежимеНеполногоВремени</name>
      <description>Работа в режиме неполного времени</description>
    </items>
    <items>
      <name>РаботаВечерниеЧасы</name>
      <description>Работа вечерние часы</description>
    </items>
    <items>
      <name>РаботаНочныеЧасы</name>
      <description>Работа ночные часы</description>
    </items>
    <items>
      <name>РабочееВремя</name>
      <description>Рабочее время</description>
    </items>
    <items>
      <name>Сверхурочные</name>
      <description>Сверхурочные</description>
    </items>
    <items>
      <name>СверхурочныеБезПовышеннойОплаты</name>
      <description>Сверхурочные без повышенной оплаты</description>
    </items>
    <items>
      <name>СокращенноеВремяОбучающихся</name>
      <description>Сокращенное время обучающихся</description>
    </items>
    <items>
      <name>СокращенноеРабочееВремя</name>
      <description>Сокращенное рабочее время</description>
    </items>
    <items>
      <name>Явка</name>
      <description>Явка</description>
    </items>
  </predefined>
  <attributes>
    <name>УдалитьИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БуквенныйКодБюджетный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БуквенныйКодБюджетный2009</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеВремя</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Целосменное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/CommonModules/УчетРабочегоВремениБазовый/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура заполняет справочник показателей т.н. псевдопредопределенными элементами, 
// идентифицируемыми из кода.
//
Процедура СоздатьВидыИспользованияРабочегоВремениПоНастройкам(НастройкиРасчетаЗарплаты) Экспорт
	
	// Установка реквизитов предопределенных элементов.
	
	ОписаниеВидаВремени = УчетРабочегоВремени.СоздатьОписаниеВидаВремени();
	ОписаниеВидаВремени.ИмяПредопределенныхДанных = "Явка";
	// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ.
	ОписаниеВидаВремени.Наименование = "Явка";
	ОписаниеВидаВремени.БуквенныйКод = "Я";
	ОписаниеВидаВремени.БуквенныйКодБюджетный = "Я";
	ОписаниеВидаВремени.БуквенныйКодБюджетный2009 = "Я";
	ОписаниеВидаВремени.ЦифровойКод = "01";
	ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Продолжительность работы в дневное время';
													|en = 'Duration of day work '");
	ОписаниеВидаВремени.РабочееВремя = Истина;
	ОписаниеВидаВремени.Целосменное = Ложь;
	
	УчетРабочегоВремени.НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени); 
	
	ОписаниеВидаВремени = УчетРабочегоВремени.СоздатьОписаниеВидаВремени();
	ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ОсновнойОтпуск";
	// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ.
	ОписаниеВидаВремени.Наименование = "Отпуск";
	ОписаниеВидаВремени.БуквенныйКод = "ОТ";
	ОписаниеВидаВремени.БуквенныйКодБюджетный = "О";
	ОписаниеВидаВремени.БуквенныйКодБюджетный2009 = "О";
	ОписаниеВидаВремени.ЦифровойКод = "09";
	ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Отпуск';
													|en = 'Leave'");
	ОписаниеВидаВремени.РабочееВремя = Ложь;
	ОписаниеВидаВремени.Целосменное = Истина;
	
	УчетРабочегоВремени.НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
	
	ОписаниеВидаВремени = УчетРабочегоВремени.СоздатьОписаниеВидаВремени();
	ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ОтпускПоБеременностиИРодам";
	// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ.
	ОписаниеВидаВремени.Наименование = "Отпуск по беременности и родам";
	ОписаниеВидаВремени.БуквенныйКод = "Р";
	ОписаниеВидаВремени.БуквенныйКодБюджетный = "Б";
	ОписаниеВидаВремени.БуквенныйКодБюджетный2009 = "Р";
	ОписаниеВидаВремени.ЦифровойКод = "14";
	ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Отпуск по беременности и родам';
													|en = 'Maternity leave'");
	ОписаниеВидаВремени.РабочееВремя = Ложь;
	ОписаниеВидаВремени.Целосменное = Истина;
	
	УчетРабочегоВремени.НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
	
	ОписаниеВидаВремени = УчетРабочегоВремени.СоздатьОписаниеВидаВремени();
	ОписаниеВидаВремени.ИмяПредопределенныхДанных = "Болезнь";
	// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ.
	ОписаниеВидаВремени.Наименование = "Больничный";
	ОписаниеВидаВремени.БуквенныйКод = "Б";
	ОписаниеВидаВремени.БуквенныйКодБюджетный = "Б";
	ОписаниеВидаВремени.БуквенныйКодБюджетный2009 = "Б";
	ОписаниеВидаВремени.ЦифровойКод = "19";
	ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Временная нетрудоспособность с назначением пособия согласно законодательству';
													|en = 'Temporary incapacity for work with provision of allowance in accordance with the law'");
	ОписаниеВидаВремени.РабочееВремя = Ложь;
	ОписаниеВидаВремени.Целосменное = Истина;
	
	УчетРабочегоВремени.НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
	
	ОписаниеВидаВремени = УчетРабочегоВремени.СоздатьОписаниеВидаВремени();
	ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ВыходныеДни";
	// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ.
	ОписаниеВидаВремени.Наименование = "Выходные дни";
	ОписаниеВидаВремени.БуквенныйКод = "В";
	ОписаниеВидаВремени.БуквенныйКодБюджетный = "В";
	ОписаниеВидаВремени.БуквенныйКодБюджетный2009 = "В";
	ОписаниеВидаВремени.ЦифровойКод = "26";
	ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Выходные дни (еженедельный отпуск) и  нерабочие праздничные дни';
													|en = 'Weekends (weekly leave) and public holidays '");
	ОписаниеВидаВремени.РабочееВремя = Ложь;
	ОписаниеВидаВремени.Целосменное = Истина;
	
	УчетРабочегоВремени.НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
	
	СоздатьВидыИспользованияРабочегоВремениОтпускБезОплаты();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ОтключитьНеИспользуемыеВидыИспользованияРабочегоВремени() Экспорт
	
	ОставляемыеВидыИспользованияРабочегоВремени = Новый Массив;
	
	ВидВремени = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Явка");
	Если ВидВремени <> Неопределено Тогда
		ОставляемыеВидыИспользованияРабочегоВремени.Добавить(ВидВремени);
	КонецЕсли;
	
	ВидВремени = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ОсновнойОтпуск");
	Если ВидВремени <> Неопределено Тогда
		ОставляемыеВидыИспользованияРабочегоВремени.Добавить(ВидВремени);
	КонецЕсли;
	
	ВидВремени = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам");
	Если ВидВремени <> Неопределено Тогда
		ОставляемыеВидыИспользованияРабочегоВремени.Добавить(ВидВремени);
	КонецЕсли;
	
	ВидВремени = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Болезнь");
	Если ВидВремени <> Неопределено Тогда
		ОставляемыеВидыИспользованияРабочегоВремени.Добавить(ВидВремени);
	КонецЕсли;
	
	ВидВремени = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ВыходныеДни");
	Если ВидВремени <> Неопределено Тогда
		ОставляемыеВидыИспользованияРабочегоВремени.Добавить(ВидВремени);
	КонецЕсли;
	
	ВидВремени = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоЗаконодательству");
	Если ВидВремени <> Неопределено Тогда
		ОставляемыеВидыИспользованияРабочегоВремени.Добавить(ВидВремени);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОставляемыеВидыИспользованияРабочегоВремени", ОставляемыеВидыИспользованияРабочегоВремени);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыИспользованияРабочегоВремени.ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени
		|ГДЕ
		|	НЕ ВидыИспользованияРабочегоВремени.Ссылка В (&ОставляемыеВидыИспользованияРабочегоВремени)
		|	И ВидыИспользованияРабочегоВремени.ИмяПредопределенныхДанных <> """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		УчетРабочегоВремени.ОтключитьИспользованиеПредопределенногоЭлемента(Выборка.ИмяПредопределенныхДанных);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВидыИспользованияРабочегоВремениОбработкаПроверкиЗаполнения(ПроверяемыйОбъект, Отказ, ПроверяемыеРеквизиты, СтандартнаяОбработка) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПроверяемыеРеквизиты, "БуквенныйКодБюджетный");
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПроверяемыеРеквизиты, "ОсновноеВремя");
	
КонецПроцедуры

Процедура СоздатьВидыИспользованияРабочегоВремениОтпускБезОплаты() Экспорт
	
	ОписаниеВидаВремени = УчетРабочегоВремени.СоздатьОписаниеВидаВремени();
	ОписаниеВидаВремени.ИмяПредопределенныхДанных = "НеоплачиваемыйОтпускПоЗаконодательству";
	// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ.
	ОписаниеВидаВремени.Наименование = "Отпуск неоплачиваемый в соответствии с законом";
	ОписаниеВидаВремени.БуквенныйКод = "ОЗ";
	ОписаниеВидаВремени.БуквенныйКодБюджетный = "ОЗ";
	ОписаниеВидаВремени.БуквенныйКодБюджетный2009 = "ОЗ";
	ОписаниеВидаВремени.ЦифровойКод = "17";
	ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Отпуск неоплачиваемый в соответствии с законом';
													|en = 'Unpaid leave according to the law'");
	ОписаниеВидаВремени.РабочееВремя = Ложь;
	ОписаниеВидаВремени.Целосменное = Ложь;
	
	УчетРабочегоВремени.НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
	
КонецПроцедуры

#КонецОбласти
